In [1]:
# load pandas
import pandas as pd
import numpy as np

url = 'https://github.com/mattharrison/datasets/raw/master/data/vehicles.csv.zip'
df = pd.read_csv(url)

# loading the columns of the dataset
city_mpg = df.city08
highway_mpg = df.highway08

url = 'https://github.com/mattharrison/datasets/raw/master/data/alta-noaa-1980-2019.csv'
alta_df = pd.read_csv(url)
dates = pd.to_datetime(alta_df.DATE)

C:\Users\sunse\AppData\Local\Temp\ipykernel_39636\2335691605.py:6: DtypeWarning: Columns (68,70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(url)

## 11. Dataframes

In [3]:
# create dataframe
df = pd.DataFrame(
    {
        'growth': [.5, .7, 1.2],
        'Name': ['Paul', 'George', 'Ringo']
    }
)

In [4]:
df

   growth    Name
0     0.5    Paul
1     0.7  George
2     1.2   Ringo

In [6]:
# access a row
df.iloc[1]

growth       0.7
Name      George
Name: 1, dtype: object

In [9]:
df['Name'] # return pd series

0      Paul
1    George
2     Ringo
Name: Name, dtype: object

In [11]:
df['Name'].str.lower() # return pd series

0      paul
1    george
2     ringo
Name: Name, dtype: object

In [10]:
df[['Name']] # returns pd dataframe

     Name
0    Paul
1  George
2   Ringo

In [19]:
# dataframe created from numpy array
np.random.seed(42)
pd.DataFrame(
    np.random.randn(10,3),
    columns=['a','b','c']
)

          a         b         c
0  0.496714 -0.138264  0.647689
1  1.523030 -0.234153 -0.234137
2  1.579213  0.767435 -0.469474
3  0.542560 -0.463418 -0.465730
4  0.241962 -1.913280 -1.724918
5 -0.562288 -1.012831  0.314247
6 -0.908024 -1.412304  1.465649
7 -0.225776  0.067528 -1.424748
8 -0.544383  0.110923 -1.150994
9  0.375698 -0.600639 -0.291694

In [22]:
df

   growth    Name
0     0.5    Paul
1     0.7  George
2     1.2   Ringo

In [21]:
df.sum(axis=0)

growth                2.4
Name      PaulGeorgeRingo
dtype: object

Exercise

In [23]:
pd.DataFrame(
    {
        'name':['Alan','Bill','Cody'],
        'age':[15,19,23],
        'title':['student', 'student', 'teacher']
    }
)

   name  age    title
0  Alan   15  student
1  Bill   19  student
2  Cody   23  teacher

In [24]:
df = pd.DataFrame(
    {
        'name':['Alan','Bill','Cody'],
        'age':[15,19,23],
        'title':['student', 'student', 'teacher']
    }
)

In [25]:
df

   name  age    title
0  Alan   15  student
1  Bill   19  student
2  Cody   23  teacher

In [29]:
df.name.str.lower()

0    alan
1    bill
2    cody
Name: name, dtype: object

In [32]:
df['age'].sum(axis=0)

57